# Assignment

Q1. Write the Python program to add, subtract, multiply and divide
two pandas series ?

    Sample Series- [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import pandas as pd
a = pd.Series([2, 4, 6, 8, 10])
b = pd.Series([1, 3, 5, 7, 9])
c = a+b
print(c)

0     3
1     7
2    11
3    15
4    19
dtype: int64

Q2. Write a Python program to convert a dictionary to the Pandas
Series?
    
    Sample SeriesOriginal dictionary-
    {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
    Converted series -
    a 100
    b 200
    c 300
    d 400
    e 800
    dtype- int64

In [2]:
sample_dict = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
series = pd.Series(sample_dict)
series

a    100
b    200
c    300
d    400
e    800
dtype: int64

Q3. Write a python program to change the data type of given a
column or a Series?

    Sample SeriesOriginal Data Series0 100
    1 200
    2 python
    3 300.12
    4 400
    dtype- object
    Change the said data type to numeric0 100.00
    1 200.00
    2 NaN
    3 300.12
    4 400.00
    dtype- float64

In [3]:
array = [100,200,'python',300.12,400]
series = pd.Series(array)
print('Sample SeriesOriginal Data Series\n',series)
pd.to_numeric(series, errors='coerce')

Sample SeriesOriginal Data Series
 0       100
1       200
2    python
3    300.12
4       400
dtype: object

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

Q4. Write the python pandas program to convert the first column of a
DataFrame as a Series?

    Sample OutputOriginal DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    1st column as a Series0 1
    1 2
    2 3
    3 4
    4 7
    5 11
    Name- col1, dtype- int64
    <class 'pandas.core.series.Series'>

In [4]:
sample_dict = {'col1':[1,2,3,4,7,11], 'col2':[4,5,6,9,5,0], 'col3':[7,5,8,12,1,11]}
df = pd.DataFrame(sample_dict)
series = df['col1']
print(series)

0     1
1     2
2     3
3     4
4     7
5    11
Name: col1, dtype: int64

Q5. Write a pandas program to create the mean and standard
deviation of the data of a given Series?

    Sample OutputOriginal Data Series0 1
    1 2
    2 3
    3 4
    4 5
    5 6
    6 7
    7 8
    8 9
    9 5
    10 3
    dtype- int64
    Mean of the said Data Series4.81818181818
    Standard deviation of the said Data Series2.52262489555

In [5]:
import numpy as np
a = np.arange(1,10)
b = np.insert(a, len(a), [5,3])
#print(b)
series = pd.Series(b)
print(series)

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9     5
10    3
dtype: int32

Q6. Write a pandas program to get powers of an array values
element-wise?
 
Note First array elements raised the powers from the second array.

    Sample data: {'X ':[78,85,96,80,86], ' Y ':[84,94,89,83,86],'Z':[86,97,96,72,83]}
    Expected Output:
    X Y Z
    0 78 84 86
    1 85 94 97
    2 96 89 96
    3 80 83 72
    4 86 86 83

In [6]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})
print(df)

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

Q7. Write the pandas program to get the first 3 rows of a given
DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]
    Expected OutputFirst three rows of the data frameattempts name qualify score
    a 1 Anastasia yes 12.5
    b 3 Dima no 9.0
    c 2 Katherine yes 16.5

In [7]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
                            'Matthew', 'Laura', 'Kevin', 'Jonas'],
                    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
                    'attempts':[1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
                    'qualify': [ 'yes', 'no', 'yes' , 'no', ' no ', ' yes ', 'yes', 'no', 'no', 'yes' ] }
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j' ]

df = pd.DataFrame(exam_data, index = labels)
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Q8: Write the pandas program to select the specified columns and
the rows from a given data frame?

    Sample Python dictionary data and list labelsSelect 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.
    exam_data = {'name ': [ 'Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score'- [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes'] }
    labels = ['a ', ' b ', ' c ', ' d ', ' e ', ' f ', ' g ', 'h', 'i', 'j']
    Expected OutputSelect specific columns and rowsname score
    b Dima 9.0
    d James NaN
    f Michael 20.0
    g Matthew 14.5

In [8]:
df[['name','score']].loc[['b','d','f','g']]

      name  score
b     Dima    9.0
d    James    NaN
f  Michael   20.0
g  Matthew   14.5

Q9. Write the pandas program to calculate mean score for each
different student in DataFrame?

    Sample Python dictionary data and list labelsexam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael',
    'Matthew', 'Laura', 'Kevin', 'Jonas'],
    'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
    'attempts'- [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
    'qualify'- ['yes', 'no', ' yes ', ' no ', ' no ', ' yes ', ' yes ', ' no ', ' no ', ' yes '] }
    labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
    Expected OutputMean score for each different student in data frame:
    13.5625

In [9]:
print('Expected OutputMean score for each different student in data frame : ',df.score.mean())

Expected OutputMean score for each different student in data frame :  13.5625

Q10. Write the Pandas program to rename columns of a given
DataFrame ?

    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 9
    New data frame after renaming columns:
    Column1 Column2 Column3
    0 1 4 7
    1 2 5 8
    2 3 6 9

In [10]:
a = np.arange(1,10).reshape(3,3).T
# b = np.transpose(a)
# print(b)
df = pd.DataFrame(a, columns = ['col1', 'col2','col3'])
print('Before changing columns \n',df)
print('-'*35)
new_columns = ['Column1', 'Column2', 'Column3']
df.columns = new_columns
print('After changing columns \n',df)

Before changing columns
    col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9
-----------------------------------
After changing columns
    Column1  Column2  Column3
0        1        4        7
1        2        5        8
2        3        6        9

Q11. Write a pandas program to count city-wise number of people from
a given of data set (city, name of the person)?

    Sample data-
    city Number of people
    0 California 4
    1 Georgia 2
    2 Los Angeles 4

In [11]:
df = pd.DataFrame({'name':['A','B','C','D','E','F','G','H'],
                  'City' : ['California','Los Angeles','Georgia','Georgia','Georgia','Los Angeles','California','California']
                  })
df.groupby('City').count().reset_index('City')

          City  name
0   California     3
1      Georgia     3
2  Los Angeles     2

Q12. Write a pandas program to widen output display to see more
columns?
    
    Sample dataOriginal data frame
    col1 col2 col3
    0 1 4 7
    1 4 5 8
    2 3 6 9
    3 4 7 0
    4 5 8 1

In [12]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(d)
pd.set_option('display.width', 100)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Q13. Write a pandas program to convert the data frame column type
from string to DateTime?
    
    Sample dataString Date0 3/11/2000
    1 3/12/2000
    2 3/13/2000
    dtype- object
    Original DataFrame (string to datetime)-
    0
    0 2000-03-11
    1 2000-03-12
    2 2000-03-13

In [13]:
series = pd.Series(['3/11/2000','3/12/2000','3/13/2000'])
a = pd.to_datetime(series)
print(a)

0   2000-03-11
1   2000-03-12
2   2000-03-13
dtype: datetime64[ns]

Q14. Write a pandas program to append the data to an empty
DataFrame?

    Sample dataOriginal DataFrame- After appending some data: col1 col2 0 0 0 1 1 1 2 2 2

In [14]:
df = pd.DataFrame()
data = pd.DataFrame({"col1": range(3),"col2": range(3)})
print("After appending some data:")
df = df.append(data)
print(df)

After appending some data:
   col1  col2
0     0     0
1     1     1
2     2     2

Q15. Write a pandas program to count the number of columns of a
DataFrame?

    Sample OutputOriginal DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 8
    2 3 6 12
    3 4 9 1
    4 7 5 11
    Number of columns- 3

In [15]:
df = pd.DataFrame(np.arange(1,16).reshape(5,3), columns=['col1','col2','col3'])
print('Original Dataframe :\n',df)
print('Number of columns : ',len(df.columns))

Original Dataframe :
    col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12
4    13    14    15
Number of columns :  3

Q16. Write a Pandas program to remove the last n rows of a given
DataFrame ?

    Sample Output:
    Original DataFrame
    col1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    3 4 9 12
    4 7 5 1
    5 11 0 11
    After removing last 3 rows of the said DataFramecol1 col2 col3
    0 1 4 7
    1 2 5 5
    2 3 6 8
    
     Link for Datasets
     (https://drive.google.com/drive/folders/105ftuIwN9kqyPNEEm3E6IM7LqywjyvJa?usp=sharing)

In [16]:
df = pd.DataFrame(np.arange(1,16).reshape(5,3), columns=['col1','col2','col3'])
print('Original DataFrame\n',df)
print('\nAfter removing last 2 rows of the said DataFrame\n',df.iloc[:3,:])

Original DataFrame
    col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9
3    10    11    12
4    13    14    15

After removing last 2 rows of the said DataFrame
    col1  col2  col3
0     1     2     3
1     4     5     6
2     7     8     9

Q17. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a Pandas data frame.

In [17]:
df = pd.read_excel('data/coalpublic2013.xlsx')
df.head(5)

   Year  MSHA ID                       Mine_Name  Production  Labor_Hours
0  2013   103381            Tacoa Highwall Miner       56004        22392
1  2013   103404                Reid School Mine       28807        28447
2  2013   100759  North River #1 Underground Min     1440115       474784
3  2013   103246                      Bear Creek       87587        29193
4  2013   103451                     Knight Mine      147499        46393

Q18. Write a Pandas program to import excel data (coalpublic2013.xlsx
) into a data frame and find details where "Mine Name" starts with
"P.

In [18]:
df[df['Mine_Name'].map(lambda x: x.startswith('P'))]

    Year  MSHA ID                      Mine_Name  Production  Labor_Hours
13  2013   103332                  Powhatan Mine      140521        61394
18  2013   102976  Piney Woods Preparation Plant           0        14828
19  2013   102976  Piney Woods Preparation Plant           0        23193
46  2013   103321                 Poplar Springs      189370        76366

Q19. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find the list of employees where
hire_date> 01-01-07.

In [19]:
df = pd.concat(pd.read_excel('data/employee.xlsx', sheet_name=None), ignore_index=True)
#df = pd.read_excel('data/employee.xlsx', sheet_name=None, ignore_index=True)
df[df.hire_date > '2007-01-01']

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10
24     124      Kevin     Mourgos 2007-11-16
27     127      James      Landry 2007-01-14
28     128     Steven      Markle 2008-03-08
32     132         TJ       Olson 2007-04-10
35     135         Ki         Gee 2007-12-12
36     136      Hazel  Philtanker 2008-02-06
46     148     Gerald   Cambrault 2007-10-15
47     149      Eleni     Zlotkey 2008-01-29

Q20. Write a Pandas program to import excel data (employee.xlsx )
into a Pandas dataframe and find a list of the employees of a specified
year

In [20]:
def print_employee(df, year):
    print('\n\nList of employee for the year {}\n'.format(year))
    year_df = df[df.year == year]
    print(year_df.iloc[:,:4])

# df['year'] = pd.DatetimeIndex(df['hire_date']).year
df['year'] = df.hire_date.dt.year
year_unique = sorted(df.year.unique())
#year_unique
for i in year_unique:
    print_employee(df,i)

List of employee for the year 2001

   emp_id first_name last_name  hire_date
2     102        Lex   De Haan 2001-01-13


List of employee for the year 2002

    emp_id first_name  last_name  hire_date
8      108      Nancy  Greenberg 2002-08-17
9      109     Daniel     Faviet 2002-08-16
14     114        Den   Raphaely 2002-12-07


List of employee for the year 2003

    emp_id first_name last_name  hire_date
0      100     Steven      King 2003-06-17
15     115  Alexander      Khoo 2003-05-18
22     122      Payam  Kaufling 2003-05-01
37     137     Renske    Ladwig 2003-07-14
39     141     Trenna      Rajs 2003-10-17


List of employee for the year 2004

    emp_id first_name last_name  hire_date
20     120    Matthew     Weiss 2004-07-18
33     133      Jason    Mallin 2004-06-14
43     145       John   Russell 2004-10-01


List of employee for the year 2005

    emp_id first_name  last_name  hire_date
1      101      Neena    Kochhar 2005-09-21
5      105      David     Austin 2005-06-25
10     110       John       Chen 2005-09-28
11     111     Ismael    Sciarra 2005-09-30
16     116     Shelli      Baida 2005-12-24
17     117      Sigal     Tobias 2005-07-24
21     121       Adam      Fripp 2005-04-10
23     123     Shanta    Vollman 2005-10-10
25     125      Julia      Nayer 2005-07-16
29     129      Laura     Bissot 2005-08-20
30     130      Mozhe   Atkinson 2005-10-30
31     131      James     Marlow 2005-02-16
38     138    Stephen     Stiles 2005-10-26
40     142     Curtis     Davies 2005-01-29
44     146      Karen   Partners 2005-01-05
45     147    Alberto  Errazuriz 2005-03-10


List of employee for the year 2006

    emp_id   first_name    last_name  hire_date
3      103    Alexander       Hunold 2006-01-03
6      106        Valli    Pataballa 2006-02-05
12     112  Jose Manuel        Urman 2006-03-07
18     118          Guy       Himuro 2006-11-15
26     126        Irene  Mikkilineni 2006-09-28
34     134      Michael       Rogers 2006-08-26
41     143      Randall        Matos 2006-03-15
42     144        Peter       Vargas 2006-07-09


List of employee for the year 2007

    emp_id first_name   last_name  hire_date
4      104      Bruce       Ernst 2007-05-21
7      107      Diana     Lorentz 2007-02-07
13     113       Luis        Popp 2007-12-07
19     119      Karen  Colmenares 2007-08-10
24     124      Kevin     Mourgos 2007-11-16
27     127      James      Landry 2007-01-14
32     132         TJ       Olson 2007-04-10
35     135         Ki         Gee 2007-12-12
46     148     Gerald   Cambrault 2007-10-15


List of employee for the year 2008

    emp_id first_name   last_name  hire_date
28     128     Steven      Markle 2008-03-08
36     136      Hazel  Philtanker 2008-02-06
47     149      Eleni     Zlotkey 2008-01-29

## Great Job!